#!/bin/bash
# --------------------------------------------------------------------------------------------------
# Данный файл настроек предназначен для развертывания openvpn сервера
# --------------------------------------------------------------------------------------------------

# --------------------------------------------------------------------------------------------------
# В этом фрагменте задаются переменные
# --------------------------------------------------------------------------------------------------
SCRIPT_PATH="$( cd -- "$(dirname "$0")" >/dev/null 2>&1 ; pwd -P )"
NON_ROOT_USER=www
EASY_RSA=$HOME/easy-rsa
SERVER_NAME=server
CLIENT_DIR=$HOME/client-configs
OPENVPN_PORT=443
# --------------------------------------------------------------------------------------------------

# --------------------------------------------------------------------------------------------------
# 1. Установка OpenVPN и Easy-RSA
# --------------------------------------------------------------------------------------------------
echo "============================================================================================"
echo "Установка OpenVPN и Easy-RSA"
echo "============================================================================================"
rm -rf $EASY_RSA/pki &> /dev/null
rm -f $EASY_RSA/ta.key &> /dev/null
mkdir -p $EASY_RSA
ln -s /usr/share/easy-rsa/* $EASY_RSA/ &> /dev/null
sudo chown $NON_ROOT_USER $EASY_RSA
chmod 700 $EASY_RSA
echo "============================================================================================"
# --------------------------------------------------------------------------------------------------

# --------------------------------------------------------------------------------------------------
# 2. Создание PKI для OpenVPN
# --------------------------------------------------------------------------------------------------
echo "============================================================================================"
echo "Создание PKI для OpenVPN"
echo "============================================================================================"
echo "set_var EASYRSA_REQ_COUNTRY    \"US\"" > $EASY_RSA/vars
echo "set_var EASYRSA_REQ_PROVINCE   \"NewYork\"" >> $EASY_RSA/vars
echo "set_var EASYRSA_REQ_CITY       \"New York City\"" >> $EASY_RSA/vars
echo "set_var EASYRSA_REQ_ORG        \"DigitalOcean\"" >> $EASY_RSA/vars
echo "set_var EASYRSA_REQ_EMAIL      \"www@digitalocean-ny3\"" >> $EASY_RSA/vars
echo "set_var EASYRSA_REQ_OU         \"Community\"" >> $EASY_RSA/vars
echo "set_var EASYRSA_ALGO           \"ec\"" >> $EASY_RSA/vars
echo "set_var EASYRSA_DIGEST         \"sha512\"" >> $EASY_RSA/vars
# Создание pki дирректории
cd $EASY_RSA
./easyrsa init-pki
./easyrsa build-ca nopass
echo "============================================================================================"
# --------------------------------------------------------------------------------------------------

# --------------------------------------------------------------------------------------------------
# 3. Создание запроса сертификата и закрытого ключа сервера OpenVPN
# --------------------------------------------------------------------------------------------------
echo "============================================================================================"
echo "Создание запроса сертификата и закрытого ключа сервера OpenVPN"
echo "============================================================================================"
cd $EASY_RSA
./easyrsa gen-req $SERVER_NAME nopass
sudo cp $EASY_RSA/pki/private/server.key /etc/openvpn/server/
echo "============================================================================================"
# --------------------------------------------------------------------------------------------------

# --------------------------------------------------------------------------------------------------
# ПРИМЕЧАНИЕ: когда-нибудь будут сделаны скрипты для настройки отдельного ЦС
# --------------------------------------------------------------------------------------------------
echo "============================================================================================"
echo "ПРИМЕЧАНИЕ: когда-нибудь будут сделаны скрипты для настройки отдельного ЦС"
echo "============================================================================================"
cd $EASY_RSA
./easyrsa build-ca nopass
echo "============================================================================================"
# --------------------------------------------------------------------------------------------------

# --------------------------------------------------------------------------------------------------
# 4. Подпись запроса сертификата сервера OpenVPN
# --------------------------------------------------------------------------------------------------
echo "============================================================================================"
echo "Подпись запроса сертификата сервера OpenVPN"
echo "============================================================================================"
# на стороне openvpn сервера
cp $EASY_RSA/pki/reqs/server.req /tmp
# Далее идут действия, которые выполняются на ЦС
cd $EASY_RSA
#./easyrsa import-req /tmp/server.req server
./easyrsa sign-req server $SERVER_NAME
cp pki/issued/server.crt /tmp
cp pki/ca.crt /tmp
# теперь все на стороне сервера open vpn
sudo cp /tmp/{server.crt,ca.crt} /etc/openvpn/server
echo "Подпись завершена"
ls /etc/openvpn/server
echo "============================================================================================"
# --------------------------------------------------------------------------------------------------

# --------------------------------------------------------------------------------------------------
# 5. Настройка криптографических материалов OpenVPN
# --------------------------------------------------------------------------------------------------
echo "============================================================================================"
echo "Настройка криптографических материалов OpenVPN"
echo "============================================================================================"
cd $EASY_RSA
openvpn --genkey secret ta.key
sudo cp ta.key /etc/openvpn/server
echo "Создание ta.key завершено"
echo "============================================================================================"
# --------------------------------------------------------------------------------------------------

# --------------------------------------------------------------------------------------------------
# 6. Создание конфигурационного файла и конфигурация сети
# --------------------------------------------------------------------------------------------------
echo "============================================================================================"
echo "Создание конфигурационного файла и конфигурация сети"
echo "============================================================================================"
PUBLIC_INTERFACE=$(ip route list default | cut -f 5 -d" ")
IP_ADDR_SERVER=$(ip addr show dev $PUBLIC_INTERFACE | \
	grep -m 1 "inet" | \
	awk '{print $2}' | \
	cut -f 1 -d "/")
echo "Имя публичного интерфейса: $PUBLIC_INTERFACE"
echo "IP адрес сервера $IP_ADDR_SERVER"
sudo cp $SCRIPT_PATH/server.conf.default /etc/openvpn/server/server.conf
sudo cp /etc/sysctl.conf /etc/sysctl.conf.backup
sudo sed 's/#*\s*net.ipv4.ip_forward\s*=\s*1/net.ipv4.ip_forward = 1/' /etc/sysctl.conf.backup > /tmp/sysctl.conf
sudo cp /tmp/sysctl.conf /etc/sysctl.conf
cat /etc/sysctl.conf | grep "net.ipv4.ip_forward"
sudo sysctl -p

echo "Изменение правил ufw"
cd $SCRIPT_PATH
sudo cp before.rules /etc/ufw/before.rules
sudo sed 's/DEFAULT_FORWARD_POLICY="DROP"/DEFAULT_FORWARD_POLICY="ACCEPT"/' /etc/default/ufw > /tmp/ufw
sudo cp /tmp/ufw /etc/default/ufw
echo "Правила UFW:"
sudo cat /etc/default/ufw | grep "DEFAULT_FORWARD_POLICY"
sudo ufw allow 443/tcp
sudo ufw allow OpenSSH
echo "Перезапуск службы UFW"
sudo ufw disable
sudo ufw enable
echo "Запуск службы OpenVPN"
sudo systemctl -f enable openvpn-server@$SERVER_NAME.service
sudo systemctl restart openvpn-server@$SERVER_NAME.service
sudo systemctl status openvpn-server@$SERVER_NAME.service
echo "============================================================================================"
# --------------------------------------------------------------------------------------------------

# --------------------------------------------------------------------------------------------------
# Создание инфраструктуры конфигурации клиентских систем
# --------------------------------------------------------------------------------------------------
echo "============================================================================================"
echo "Создание инфраструктуры конфигурации клиентских систем"
echo "============================================================================================"
echo "Создание дирректорий с конфигами клиентов"
rm -rf $CLIENT_DIR
mkdir -p $CLIENT_DIR/files
cat base.conf | sed "s#IP_ADDR_SERVER\sPORT_SERVER#$IP_ADDR_SERVER $OPENVPN_PORT#" > $CLIENT_DIR/base.conf
cp make_client.sh $CLIENT_DIR/
chmod u+x $CLIENT_DIR/make_client.sh
echo "============================================================================================"
echo "Сервер развернут"
echo "============================================================================================"
# --------------------------------------------------------------------------------------------------
